/*****************************************************************************

  C_UdpSocket

  Класс UDP-сокета, реализующий интерфейс I_Socket поверх системной библиотеки
  сокетов ОС Windows - WINSOCK


  ОПИСАНИЕ

  * UDP-сокет представляет собой сетевой интерфейс для взаимодействия по UDP


  ИСПОЛЬЗОВАНИЕ

  * Использование объектов класса C_UdpSocket равносильно работе с объектами,
    реализующими интерфейс I_Socket (см. I_Socket.h)

*****************************************************************************/

#pragma once

#include <winsock2.h>

#include "C_Socket.h"
#include "C_Logger.h"

namespace network {

using namespace services;

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

/*****************************************************************************
 * Класс UDP-сокета, реализующий интерфейс I_Socket поверх системной библиотеки
 * сокетов ОС Windows - WINSOCK
 */
class C_UdpSocket : public C_Socket
{

public:

    C_UdpSocket() : C_Socket( E_Protocol::UDP, "udp socket" ) { }
    virtual ~C_UdpSocket() override = default;

    /**
     * Отправка и прием данных
     */

    virtual bool send( const std::vector<char> &a_buff ) override;
    virtual bool recv(       std::vector<char> &a_buff ) override;

    // Инициализация подключения (заглушка для UDP-протокола)
    virtual bool connect() override { return true; }

};

/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

/*****************************************************************************
  Variables Definitions
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} //namespace network

